{
  "backend/main.mo": "Defines the main canister with user profiles, transactions, game logic, admin credit updates, coupon/referral systems, and various state maps.",
  "feature_evidence.json": "Contains a feature evidence report linking a UI backdrop-blur feature to affected files and components with confidence metadata.",
  "frontend-file-summaries.txt": "Lists short summaries of many frontend source files including pages, hooks, and components.",
  "frontend/index.css": "Global Tailwind CSS config defining theme variables, dark mode values, and base styling for the app.",
  "frontend/index.html": "Base HTML template mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router configuration with public, protected admin routes, layout wrapper, and page component mapping.",
  "frontend/src/components/admin/PaymentSetup.tsx": "Empty placeholder file for admin payment setup component.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Component that checks admin permission and redirects unauthorized users to the unauthorized page.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first‑time profile setup including name, DOB, referral handling, and welcome bonus logic.",
  "frontend/src/components/common/PremiumSpinner.tsx": "Stylized loading spinner component with configurable size and layered visual effects.",
  "frontend/src/components/game/SpinWheel.tsx": "Canvas-based spin wheel that draws styled segments and handles spinning state and celebrations.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout providing navigation, header, animated background, and mobile menu handling.",
  "frontend/src/components/wallet/BalanceTicker.tsx": "Animated numeric ticker that smoothly transitions displayed credit balance.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor based on identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity with login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations like profiles, spinning, admin checks, and payments.",
  "frontend/src/index.css": "Tailwind-based global styles defining premium theme colors, animations, and UI utility classes.",
  "frontend/src/main.tsx": "Application entrypoint initializing React root, query client, identity provider, and global styles.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Provides admin navigation cards for managing users, wheel config, withdrawals, and manual payment requests.",
  "frontend/src/pages/admin/AdminManualPaymentRequestsPage.tsx": "Allows admins to view, approve, decline, and configure manual payment requests with tabbed status filtering.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Displays leaderboard-style user list and enables admins to edit user credit balances.",
  "frontend/src/pages/admin/AdminWheelConfigPage.tsx": "Lets admins view and update the house edge and shows fixed wheel probability segments.",
  "frontend/src/pages/admin/AdminWithdrawalsPage.tsx": "Placeholder page informing admins that withdrawal processing is not yet implemented.",
  "frontend/src/pages/BuyCreditsPage.tsx": "UI for buying credits via preset, custom, or package amounts, using manual payment requests and QR dialog flow.",
  "frontend/src/pages/GamePage.tsx": "Spin-and-win game page handling wheel spins, showing balance, and displaying win/loss outcomes.",
  "frontend/src/pages/LoginPage.tsx": "Login screen that authenticates users through Internet Identity with a themed UI.",
  "frontend/src/pages/payments/PaymentFailurePage.tsx": "Displays a payment failure message with options to retry or return home.",
  "frontend/src/pages/payments/PaymentSuccessPage.tsx": "Shows the status of a submitted manual payment request, refreshing data and displaying pending, approved, or declined states.",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile details including identity, balance, DOB, bonuses, and transaction count.",
  "frontend/src/pages/TransactionsPage.tsx": "Shows full transaction history with deposit, withdrawal, and game spin entries.",
  "frontend/src/pages/UnauthorizedPage.tsx": "Access-denied page for unauthorized users with a button to return to the main route.",
  "frontend/src/pages/WalletPage.tsx": "Displays the user’s wallet balance, recent transactions, and navigation to buy credits or withdraw.",
  "frontend/src/pages/WithdrawPage.tsx": "Shows withdrawal information and alerts users that withdrawals must be requested via support.",
  "frontend/src/utils/creditPricing.ts": "Provides helpers to derive a credits-per-INR ratio from packages and compute or validate credit amounts.",
  "frontend/src/utils/currency.ts": "Utility functions for formatting INR and converting between rupees and paise.",
  "frontend/src/utils/razorpay.ts": "Empty placeholder file for Razorpay-related utilities.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, clearing, and managing URL and session-stored parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and responsive container settings.",
  "project_state.json": "Project metadata tracking features, issues, and a request to add blurred or dimmed backgrounds behind popups."
}