{
  "backend/main.mo": "Main backend canister defining user profiles, game logic, transactions, access control, Stripe config, and admin update functions.",
  "feature_evidence.json": "Feature evidence report mapping product features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for many frontend source files and components.",
  "frontend/index.css": "Global Tailwind CSS configuration defining theme variables and dark mode styles.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router configuration with authenticated layout, routes, admin guards, and global providers.",
  "frontend/src/components/admin/PaymentSetup.tsx": "Empty placeholder component file for admin payment setup.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard that checks admin status and redirects unauthorized users, with loading skeletons.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first‑time profile setup with form validation, referral handling, and welcome bonus flow.",
  "frontend/src/components/common/PageHeader.tsx": "Renders a page header with title, optional description, badge, and action elements.",
  "frontend/src/components/common/PremiumSpinner.tsx": "Displays a customizable premium spinner with layered animated visuals.",
  "frontend/src/components/game/SpinWheel.tsx": "Implements a visual spin wheel using canvas rendering, animations, and outcome-based celebration handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main application layout with navigation, user data integration, mobile menu, and animated background.",
  "frontend/src/components/wallet/BalanceTicker.tsx": "Animates balance changes by smoothly incrementing displayed credits.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profile, admin checks, wheel spins, leaderboard, and configuration retrieval.",
  "frontend/src/index.css": "Defines Tailwind layers, custom OKLCH color variables, utility classes, gradients, shadows, and animations for premium-themed UI styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider, rendering the root App component.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Provides navigation cards for admins to manage users, wheel config, withdrawals, and payment requests.",
  "frontend/src/pages/admin/AdminManualPaymentRequestsPage.tsx": "Allows admins to view, approve, or decline manual payment requests and edit payment configuration.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Lists all users with balances and lets admins update user credit amounts.",
  "frontend/src/pages/admin/AdminWheelConfigPage.tsx": "Admin page to view and update the house edge, including validation and form submission with loading states.",
  "frontend/src/pages/admin/AdminWithdrawalsPage.tsx": "Admin UI placeholder for withdrawal request management showing pending feature notice and empty state.",
  "frontend/src/pages/BuyCreditsPage.tsx": "Provides UI and logic for purchasing credits via packages, quick offers, or custom amounts, including QR dialog handling and payment request creation.",
  "frontend/src/pages/GamePage.tsx": "Implements the spin‑wheel game UI, handling spin requests, outcomes, balance updates, and loading states.",
  "frontend/src/pages/LoginPage.tsx": "Renders a styled login screen that authenticates users via Internet Identity with premium visual effects.",
  "frontend/src/pages/payments/PaymentFailurePage.tsx": "Displays a failure message when no payment request was created, with options to retry or return home.",
  "frontend/src/pages/payments/PaymentSuccessPage.tsx": "Handles manual payment request status display with auto‑refresh logic and conditional UI for different states.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the user's profile, balance, transactions, and identity details with loading states and copy‑to‑clipboard support.",
  "frontend/src/pages/TransactionsPage.tsx": "Displays a full transaction history fetched from the user profile with loading states and icons for different transaction types.",
  "frontend/src/pages/UnauthorizedPage.tsx": "Shows an access-denied message with a button to return to the home page.",
  "frontend/src/pages/WalletPage.tsx": "Shows the user's credit balance, actions to buy or withdraw credits, and a small list of recent transactions.",
  "frontend/src/pages/WithdrawPage.tsx": "Presents withdrawal information and notes that withdrawals are not yet available.",
  "frontend/src/utils/creditPricing.ts": "Helpers to derive credits‑per‑INR ratios from packages and compute or validate credit pricing.",
  "frontend/src/utils/currency.ts": "Utility functions for INR formatting and converting between rupees and paise.",
  "frontend/src/utils/razorpay.ts": "Empty placeholder module for Razorpay-related utilities.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, supporting query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project metadata describing UI redesign goals, performance issues, and feature request tracking."
}