{
  "backend/main.mo": "Main canister actor defining user profiles, transactions, game settings, coupons, manual payments, and admin-controlled credit updates with access control.",
  "feature_evidence.json": "Feature evidence report mapping specific UI/UX requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their purpose and UI behaviors.",
  "frontend/index.css": "Tailwind CSS configuration defining theme variables, dark mode tokens, and global styling rules.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading the main script.",
  "frontend/src/App.tsx": "Main routing configuration wiring all pages, admin routes with guards, authentication flow, and theme provider setup.",
  "frontend/src/components/admin/PaymentSetup.tsx": "Admin UI for configuring Stripe with secret key and allowed countries, including validation and loading states.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Component that checks admin status and redirects unauthorized users while showing skeleton loading UI.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal form for completing initial profile setup, validating inputs and submitting to backend with referral handling.",
  "frontend/src/components/common/PageHeader.tsx": "Reusable page header showing title, optional description, badge, and action elements.",
  "frontend/src/components/common/PremiumSpinner.tsx": "Animated premium-styled loading spinner with configurable size.",
  "frontend/src/components/game/OutcomeEffects.tsx": "Displays visual win, miss, or loss animations based on game outcome with timed auto-hide.",
  "frontend/src/components/game/SpinWheel.tsx": "Manages spin wheel rendering, image loading diagnostics, and deterministic spin animation to match game outcome.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with navigation, background visuals, user profile data, and responsive mobile menu.",
  "frontend/src/components/wallet/BalanceTicker.tsx": "Animates displayed balance to smoothly count toward the latest value.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actor and invalidates queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider for managing Internet Identity authentication, login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor APIs, including user profile, payments, admin values, and game actions.",
  "frontend/src/index.css": "Configures Tailwind layers and a dark-themed OKLCH design system with custom utility classes and animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Provides admin entry points for user management, wheel config, withdrawals, and manual payments.",
  "frontend/src/pages/admin/AdminManualPaymentRequestsPage.tsx": "Allows admins to review, approve, or decline manual payment requests and configure QR/instructions.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Admin page that displays leaderboard users, allows copying principals, and editing user credit balances via a dialog.",
  "frontend/src/pages/admin/AdminWheelConfigPage.tsx": "Admin page for viewing and updating the house edge and displaying wheel segment probabilities.",
  "frontend/src/pages/admin/AdminWithdrawalsPage.tsx": "Admin withdrawals placeholder page showing pending withdrawals with functionality not yet implemented.",
  "frontend/src/pages/BuyCreditsPage.tsx": "Implements the credits purchase UI with package selection, custom amounts, QR dialog flow, and manual payment request creation.",
  "frontend/src/pages/GamePage.tsx": "Renders the spinning game interface, manages spin actions, displays outcomes, and shows animations and toasts.",
  "frontend/src/pages/LoginPage.tsx": "Presents the login screen using Internet Identity with a styled premium UI layout.",
  "frontend/src/pages/payments/PaymentFailurePage.tsx": "Displays a failed payment submission message with options to retry or return to the game.",
  "frontend/src/pages/payments/PaymentSuccessPage.tsx": "Shows the status of a manual payment request, refreshing related queries and displaying status-specific messaging.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the user's profile, showing identity, balance, stats, and badges with loading states.",
  "frontend/src/pages/TransactionsPage.tsx": "Shows a full transaction history with icons, amounts, and loading placeholders.",
  "frontend/src/pages/UnauthorizedPage.tsx": "Renders an access‑denied message with a button to return to the main game.",
  "frontend/src/pages/WalletPage.tsx": "Displays current balance, recent transactions, and navigation buttons for buying credits or withdrawing.",
  "frontend/src/pages/WithdrawPage.tsx": "Shows withdrawal info and notes that withdrawal functionality is still under development.",
  "frontend/src/utils/assetUrl.ts": "Builds asset URLs based on Vite's base path, normalizing slashes.",
  "frontend/src/utils/creditPricing.ts": "Utility functions for deriving credits-per-INR ratios and computing credits from INR amounts.",
  "frontend/src/utils/currency.ts": "Helpers for formatting INR and converting between rupees and paise.",
  "frontend/src/utils/generatedAssets.ts": "Defines static paths for generated wheel and visual effect assets.",
  "frontend/src/utils/razorpay.ts": "Empty placeholder file for Razorpay utilities.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling class-based dark mode, custom theme extensions, animations, and plugins for animations and typography.",
  "project_state.json": "Project state metadata describing spinner visibility issues, existing features, and project context for improving loading feedback."
}