{
  "backend/main.mo": "Actor managing user profiles, payments, game logic, transactions, and admin functions with access control and configuration state.",
  "backend/migration.mo": "Migration module converting old actor state to new format by adding lastSpinResult to user profiles and preserving all other fields.",
  "feature_evidence.json": "Feature evidence report listing frontend wheel, spin interaction, payout, and UI feature requirements with associated files and metadata.",
  "frontend-file-summaries.txt": "Text file containing short summaries of major frontend components, pages, and hooks for reference.",
  "frontend/index.css": "Tailwind base setup defining theme variables for light and dark modes and applying global background and border styles.",
  "frontend/index.html": "Base HTML mounting point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Main routing setup connecting pages, authentication, admin guards, themes, and app layout for the React frontend.",
  "frontend/src/components/admin/PaymentSetup.tsx": "Handles Stripe setup, validating secret key and country list, and shows configuration or loading state.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Protects admin routes by checking admin status and redirecting unauthorized users.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for completing initial profile with name, birth date, and optional referral, submitting via mutation.",
  "frontend/src/components/common/PageHeader.tsx": "Reusable header component displaying title, optional description, badge, and actions.",
  "frontend/src/components/common/PremiumSpinner.tsx": "Stylized animated spinner with size options for loading states.",
  "frontend/src/components/game/OutcomeEffects.tsx": "Displays visual effects based on game outcome with timed animations.",
  "frontend/src/components/game/SpinWheel.tsx": "Animates a spinning wheel to land on a backend-provided outcome using deterministic rotation.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with navigation, user profile info, admin links, and animated background.",
  "frontend/src/components/wallet/BalanceTicker.tsx": "Smoothly animates balance changes in a credit display.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout methods, and initializes AuthClient with custom options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile, admin checks, leaderboard, credit data, transactions, and wheel-spin mutations using the actor.",
  "frontend/src/index.css": "Tailwind-based global styles defining a dark theme color system and various utility classes for animations and premium UI effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard offering navigation to user management, wheel config, withdrawals, and payment requests.",
  "frontend/src/pages/admin/AdminManualPaymentRequestsPage.tsx": "Admin page to review manual payment requests, approve/decline them, and update QR/instructions config including image upload validation.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Displays leaderboard users and allows admins to edit and update user credit balances via a dialog.",
  "frontend/src/pages/admin/AdminWheelConfigPage.tsx": "Admin interface for viewing and updating the house edge percentage used in the wheel game.",
  "frontend/src/pages/admin/AdminWithdrawalsPage.tsx": "Placeholder admin page showing planned functionality for processing user withdrawal requests.",
  "frontend/src/pages/BuyCreditsPage.tsx": "UI for purchasing credits, creating manual payment requests, showing package options, payment statuses, and QR dialog handling.",
  "frontend/src/pages/GamePage.tsx": "Implements the spin‑wheel game UI, manages spin logic and outcome effects, and displays balance-based results.",
  "frontend/src/pages/LoginPage.tsx": "Renders a login screen using Internet Identity with branding and a sign‑in button that shows loading state.",
  "frontend/src/pages/payments/PaymentFailurePage.tsx": "Informs the user that no payment request was created and provides navigation to retry or return to the game.",
  "frontend/src/pages/payments/PaymentSuccessPage.tsx": "Displays status of a submitted manual payment request and refresh tools, with UI varying based on request state.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the user's profile details, balance, bonus status, and metadata with loading states and badges.",
  "frontend/src/pages/TransactionsPage.tsx": "Shows the user's full transaction history with icons, amounts, and loading placeholders.",
  "frontend/src/pages/UnauthorizedPage.tsx": "Presents an access‑denied message with a button to return to the home page.",
  "frontend/src/pages/WalletPage.tsx": "Provides balance display, buy/withdraw actions, and a list of recent transactions.",
  "frontend/src/pages/WithdrawPage.tsx": "Shows withdrawal info and notes that the withdrawal feature is still under development.",
  "frontend/src/utils/assetUrl.ts": "Builds correct asset URLs using Vite’s base path while ensuring clean slashes.",
  "frontend/src/utils/creditPricing.ts": "Utility functions for deriving credits-per-INR ratios from packages and computing credits for custom INR amounts.",
  "frontend/src/utils/currency.ts": "Simple helpers to format INR and convert between rupees and paise.",
  "frontend/src/utils/generatedAssets.ts": "Defines static paths for generated wheel and effect assets relative to the public directory.",
  "frontend/src/utils/razorpay.ts": "Empty placeholder file for Razorpay-related utilities.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash mode), store/retrieve them in sessionStorage, and persist values across navigation.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, colors, animations, and plugins for the frontend build.",
  "project_state.json": "Defines the project’s current state and requirements for implementing a 4‑section spinning wheel game with specific rules, UI effects, and payouts."
}