{
  "backend/main.mo": "Actor with access control, user profiles, credit and game logic, withdrawal handling, and Stripe config state.",
  "backend/migration.mo": "Migration module that maps old Stripe configuration field to new stripeConfig field.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and UI details of numerous frontend files.",
  "frontend/index.css": "Global Tailwind-based dark theme styles with OKLCH variables and animations.",
  "frontend/index.html": "Root HTML template loading the main React entry point.",
  "frontend/src/App.tsx": "Router setup for all pages including admin-guarded routes, theme provider, and profile setup logic.",
  "frontend/src/components/admin/PaymentSetup.tsx": "Empty placeholder file for admin Stripe configuration UI.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Component that checks admin status and redirects unauthorized users to the unauthorized page.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal that forces new users to create a profile by submitting minimal data.",
  "frontend/src/components/game/SpinWheel.tsx": "Animated spin wheel component that rotates to a target angle based on game outcome and triggers a win celebration.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with navigation, mobile menu, admin link handling, and logout integration using Internet Identity.",
  "frontend/src/components/wallet/BalanceTicker.tsx": "Smoothly animates displayed balance toward the latest value over timed incremental steps.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, logout, identity loading, and state management.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profile, spinning the wheel, admin checks, leaderboard, and house edge values.",
  "frontend/src/index.css": "Tailwind base setup plus custom theme variables, animations, and utility classes for UI styling.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard providing navigation to user management, wheel config, and withdrawals.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Lists all users ranked by credits using leaderboard data with loading state handling.",
  "frontend/src/pages/admin/AdminWheelConfigPage.tsx": "Allows admins to view and update house edge settings and displays fixed probability segments.",
  "frontend/src/pages/admin/AdminWithdrawalsPage.tsx": "Placeholder page for managing withdrawal requests, noting the feature is not yet implemented.",
  "frontend/src/pages/BuyCreditsPage.tsx": "Displays purchasable credit packages and triggers Razorpay loading for payments, with UI feedback and package selection handling.",
  "frontend/src/pages/GamePage.tsx": "Shows user balance and a spin wheel game that costs credits, handling spin results and toast notifications.",
  "frontend/src/pages/LoginPage.tsx": "Provides a branded login screen using Internet Identity authentication with loading states.",
  "frontend/src/pages/payments/PaymentFailurePage.tsx": "Shows a cancelled payment message with actions to retry or return to the game.",
  "frontend/src/pages/payments/PaymentSuccessPage.tsx": "Confirms successful payment, refreshes profile data, and links to wallet or game.",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile details including principal ID, balance, transactions count, and identity verification status.",
  "frontend/src/pages/TransactionsPage.tsx": "Shows a full, reversed transaction history with icons and labels for deposits, withdrawals, and spins.",
  "frontend/src/pages/UnauthorizedPage.tsx": "Renders an access denied message with an option to return to the main game.",
  "frontend/src/pages/WalletPage.tsx": "Displays the user's wallet with balance, recent transactions, and navigation to buy credits or withdraw.",
  "frontend/src/pages/WithdrawPage.tsx": "Shows withdrawal info and a notice that withdrawal functionality is not yet implemented.",
  "frontend/src/utils/currency.ts": "Utility functions for formatting INR and converting between rupees and paise.",
  "frontend/src/utils/razorpay.ts": "Defines Razorpay types and a loader for the Razorpay checkout script.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and plugins for the frontend.",
  "project_state.json": "Defines project state, architectural notes, known issues, required images, and existing feature metadata for build planning."
}