{
  "backend/main.mo": "Defines the backend canister with access control, user profiles, game logic, payment structures, and maps for users, transactions, coupons, and configuration.",
  "feature_evidence.json": "Lists feature evidence entries describing wheel UI fixes, pointer animation changes, and related affected files.",
  "frontend-file-summaries.txt": "Provides short textual summaries of various frontend files for quick reference.",
  "frontend/index.css": "Defines Tailwind base/theme variables, dark mode values, and global styles.",
  "frontend/index.html": "Base HTML template mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures routing, authentication handling, layout, and admin-protected routes for the React app.",
  "frontend/src/components/admin/PaymentSetup.tsx": "Admin UI for configuring Stripe payments with validation, status display, and async submission.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Protects admin routes by checking admin status and redirecting unauthorized users with loading skeletons.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for initial profile setup with form fields, validation, and referral handling.",
  "frontend/src/components/common/PageHeader.tsx": "Reusable page header displaying a title, optional description, badge, and action buttons.",
  "frontend/src/components/common/PremiumSpinner.tsx": "Animated premium-style spinner component with configurable sizes.",
  "frontend/src/components/game/OutcomeEffects.tsx": "Shows animated visual effects based on game outcome and hides them after a timed duration.",
  "frontend/src/components/game/SpinWheel.tsx": "Spinning wheel component that animates deterministically to land on a given outcome and triggers a callback when done.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with navigation, user data, mobile menu, and animated background.",
  "frontend/src/components/wallet/BalanceTicker.tsx": "Animated counter that smoothly updates the displayed credit balance.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for profile, admin status, leaderboard, credit data, spinning the wheel, and profile setup, all tied to an actor instance.",
  "frontend/src/index.css": "Defines Tailwind layers, dark theme OKLCH color variables, base styles, and custom utility classes including animations and premium UI effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Provides admin navigation cards for managing users, wheel config, withdrawals, and payment requests.",
  "frontend/src/pages/admin/AdminManualPaymentRequestsPage.tsx": "Allows admins to view, approve, decline manual payment requests and configure QR/instruction settings.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Displays leaderboard users for admins with ability to edit and update user credit balances.",
  "frontend/src/pages/admin/AdminWheelConfigPage.tsx": "Shows and updates the house edge configuration for the wheel game, including validation and saving.",
  "frontend/src/pages/admin/AdminWithdrawalsPage.tsx": "Placeholder admin page for managing withdrawal requests, currently showing no pending items.",
  "frontend/src/pages/BuyCreditsPage.tsx": "Implements a UI for purchasing credits, creating manual payment requests, viewing request statuses, and displaying payment configuration.",
  "frontend/src/pages/GamePage.tsx": "Implements the spin‑wheel game page, handling spins, outcomes, balance updates, and visual effects with profile-dependent behavior.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with Internet Identity authentication and premium-styled UI elements.",
  "frontend/src/pages/payments/PaymentFailurePage.tsx": "Shows a failure message when a payment request is not created and provides retry or return options.",
  "frontend/src/pages/payments/PaymentSuccessPage.tsx": "Displays the status of a submitted manual payment request and refreshes related user data.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the user's profile info including name, DOB, balance, and badges with loading states and clipboard copy support.",
  "frontend/src/pages/TransactionsPage.tsx": "Shows a full transaction history with icons, amounts, and loading placeholders.",
  "frontend/src/pages/UnauthorizedPage.tsx": "Renders an access denied message with navigation back to the home page.",
  "frontend/src/pages/WalletPage.tsx": "Displays current balance, buy/withdraw actions, and a list of recent transactions.",
  "frontend/src/pages/WithdrawPage.tsx": "Shows withdrawal info and alerts that withdrawals are not yet implemented.",
  "frontend/src/utils/assetUrl.ts": "Builds full asset URLs using the app’s base path while handling slashes safely.",
  "frontend/src/utils/creditPricing.ts": "Provides helpers to derive credits-per-INR ratios, compute credits from INR, and validate package availability.",
  "frontend/src/utils/currency.ts": "Formats INR values and converts between rupees and paise.",
  "frontend/src/utils/generatedAssets.ts": "Lists static paths for pre-generated wheel and effect assets used throughout the UI.",
  "frontend/src/utils/razorpay.ts": "Empty placeholder for Razorpay-related utilities.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL parameters with session fallback.",
  "frontend/tailwind.config.js": "Tailwind config enabling class-based dark mode, custom colors, fonts, animations, and plugins for animations and typography.",
  "project_state.json": "Project state describing wheel UI issues, required fixes, and pending feature requests for label centering and pointer alignment, styling, and animation."
}