{
  "kind": "build_request",
  "title": "Fix wheel segment label positioning and pointer alignment/style/animation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the wheel SVG label positioning so that all segment texts (TIGER / DRAGON / MISS / CRIT and their multipliers) appear clearly centered inside their respective wheel wedges (not sitting on/overlapping the segment borders/dividing lines) across responsive sizes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "first of all the text is not inside segment its on border fix it"
        ]
      },
      "acceptanceCriteria": [
        "On the Game wheel, each segment label and its multiplier is visually inside the segment area with comfortable padding from the rim and divider lines at common viewport sizes (mobile and desktop).",
        "No label text overlaps the cross dividers or outer/inner rims."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the wheel pointer is positioned at the exact top-middle (12 o’clock), horizontally centered over the wheel, and remains centered even while its animation runs (i.e., do not allow CSS animations to override the centering transform).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "second the pointer should be in top middle not topleft",
          "2 yes"
        ]
      },
      "acceptanceCriteria": [
        "Pointer’s tip visually aligns with the 12 o’clock position at the top of the wheel.",
        "During the pointer animation, the pointer does not drift left/right and stays horizontally centered."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove the grey border/background from the pointer graphic so only the yellow pointer (with glow) remains on a transparent background, and update the app to use the cleaned asset for the wheel pointer.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "its grey border should be removed only yellow part is needed"
        ]
      },
      "acceptanceCriteria": [
        "The pointer image renders without any grey square/border behind it (transparent background).",
        "The pointer still appears as a glowing yellow triangle against the dark UI."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Change the pointer animation from left-right/scale pulsing to a repeating up-down motion (up, down, up, down), while preserving the pointer’s 12 o’clock centered position.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "instead of animating it left to right add animation up down up down"
        ]
      },
      "acceptanceCriteria": [
        "Pointer animates vertically (subtle bobbing) in a continuous loop.",
        "Animation does not introduce any horizontal movement or misalignment."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose them instead).",
    "Do not modify immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Keep backend as single-actor; no backend changes are required for these UI-only fixes."
  ],
  "nonGoals": [
    "Changing game outcome logic or spin determinism.",
    "Adding new wheel segments or altering payout values."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Remove the grey border/background so only the yellow glowing triangle remains on transparency (glowing-yellow-pointer.dim_256x256.png > glowing-yellow-pointer-clean.dim_256x256.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}