{
  "kind": "build_request",
  "title": "Make the spinning/loading spinner visible during wheel spins",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the spinner is clearly visible when the user taps the Spin button (during `isSpinning` / `showEffects` states), including when the button is disabled. The spinner and the \"Spinning...\" label must not be faded out by disabled styling in dark mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "where is the spinner"
        ]
      },
      "acceptanceCriteria": [
        "On GamePage, when a spin is in progress, the Spin button shows a clearly visible animated spinner and the text \"Spinning...\".",
        "The spinner remains clearly visible even though the button is disabled to prevent double-clicking (i.e., disabled-state opacity does not make the spinner effectively invisible).",
        "The spinner and text have sufficient contrast against the button background in the default dark theme."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Standardize wheel loading feedback so users always see an obvious loading indicator while the wheel image is loading (or slow to load), and it remains visible until the wheel image is actually rendered.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "where is the spinner"
        ]
      },
      "acceptanceCriteria": [
        "When the wheel image has not loaded yet, the wheel area displays a clearly visible loading indicator (spinner + short label).",
        "Once the wheel image loads successfully, the loading indicator disappears and the wheel is shown.",
        "If the wheel image errors/timeouts, the UI shows a clear fallback state (not a blank area)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only); compose/override styles at usage sites (e.g., GamePage) or in non-immutable components like PremiumSpinner."
  ],
  "nonGoals": [
    "Changing backend spin logic or timing.",
    "Adding new payment or authentication features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}