{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix wheel label layout and pointer alignment/asset/animation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Reposition wheel SVG segment labels so each label and multiplier is centered within its wedge with padding from dividers/rims across responsive sizes.",
      "acceptanceCriteria": [
        "On the Game wheel, each segment label and its multiplier is visually inside the segment area with comfortable padding from the rim and divider lines at common viewport sizes (mobile and desktop).",
        "No label text overlaps the cross dividers or outer/inner rims."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/game/SpinWheel.tsx",
          "operation": "modify",
          "description": "Update the SVG text layout to use wedge-centered positioning (e.g., via polar-coordinate placement around the center) for TIGER/DRAGON/MISS/CRIT and their multipliers, ensuring consistent padding from divider lines and rims at all rendered sizes."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Keep the wheel pointer exactly top-center (12 o’clock) and ensure its animation does not override the centering transform.",
      "acceptanceCriteria": [
        "Pointer’s tip visually aligns with the 12 o’clock position at the top of the wheel.",
        "During the pointer animation, the pointer does not drift left/right and stays horizontally centered."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/game/SpinWheel.tsx",
          "operation": "modify",
          "description": "Refactor pointer DOM structure so centering (left-1/2 with -translate-x-1/2) is applied on a non-animated wrapper and the animation is applied on an inner element, preventing animation transforms from overriding the centering."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust wheel pointer CSS classes so the centering transform is not included in keyframes (move centering to a wrapper and keep keyframes transform-only for vertical motion/opacity as needed)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Replace the wheel pointer image with a cleaned transparent asset (no grey border/background) and wire it into the app.",
      "acceptanceCriteria": [
        "The pointer image renders without any grey square/border behind it (transparent background).",
        "The pointer still appears as a glowing yellow triangle against the dark UI."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/glowing-yellow-pointer-clean.dim_256x256.png",
          "operation": "create",
          "description": "Add the cleaned pointer asset with transparent background (derived from glowing-yellow-pointer.dim_256x256.png per imageRequirements edits)."
        },
        {
          "path": "frontend/src/utils/generatedAssets.ts",
          "operation": "modify",
          "description": "Update GENERATED_ASSETS.glowingPointer to reference frontend/public/assets/generated/glowing-yellow-pointer-clean.dim_256x256.png so the app uses the cleaned pointer asset."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Change the pointer animation to a repeating up-down bobbing motion while preserving exact 12 o’clock centering.",
      "acceptanceCriteria": [
        "Pointer animates vertically (subtle bobbing) in a continuous loop.",
        "Animation does not introduce any horizontal movement or misalignment."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Replace the existing pointerPulse keyframes with a vertical-only bobbing animation (translateY up/down) and ensure the animated element does not include any translateX in keyframes."
        },
        {
          "path": "frontend/src/components/game/SpinWheel.tsx",
          "operation": "modify",
          "description": "Wire the updated CSS animation class to the pointer inner element (leaving the wrapper responsible for absolute top placement and horizontal centering) to preserve alignment during the up-down animation."
        }
      ]
    }
  ]
}