{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Make spin and wheel loading spinners clearly visible",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Keep the in-button spinner and “Spinning...” label clearly visible during spins even while the Spin button is disabled (no disabled fade-out in dark mode).",
      "acceptanceCriteria": [
        "On GamePage, when a spin is in progress, the Spin button shows a clearly visible animated spinner and the text \"Spinning...\".",
        "The spinner remains clearly visible even though the button is disabled to prevent double-clicking (i.e., disabled-state opacity does not make the spinner effectively invisible).",
        "The spinner and text have sufficient contrast against the button background in the default dark theme."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GamePage.tsx",
          "operation": "modify",
          "description": "Update the Spin button styling so disabled state does not reduce opacity for the loading content (e.g., override disabled opacity and ensure high-contrast text). Ensure the in-button loading UI (PremiumSpinner + “Spinning...”) remains visually prominent during `isSpinning`/`showEffects` while still preventing double clicks. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Standardize wheel image loading feedback with an obvious loading indicator that persists until the wheel image renders, plus a clear fallback on error/timeout.",
      "acceptanceCriteria": [
        "When the wheel image has not loaded yet, the wheel area displays a clearly visible loading indicator (spinner + short label).",
        "Once the wheel image loads successfully, the loading indicator disappears and the wheel is shown.",
        "If the wheel image errors/timeouts, the UI shows a clear fallback state (not a blank area)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/game/SpinWheel.tsx",
          "operation": "modify",
          "description": "Refine the wheel loading states so an obvious loading indicator (spinner + label) is always shown while the image is still not rendered, and only replaced by a dedicated fallback UI when the image truly errors (or a timeout state explicitly communicates delayed loading without going blank). Standardize the indicator by using the PremiumSpinner component for consistency and adjust label contrast for the dark theme. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}